In [1]:
import pandas as pd
import seaborn as sns

In [3]:
df=sns.load_dataset('mpg')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [4]:
df['origin'].nunique()

3

In [6]:
df['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [8]:
df.groupby('origin').size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [9]:
df.groupby('origin').min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [11]:
df.groupby('origin').max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [12]:
df.groupby('origin').mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [14]:
df.groupby('origin')['cylinders'].size()

origin
europe     70
japan      79
usa       249
Name: cylinders, dtype: int64

In [15]:
df.groupby('origin')['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [16]:
df.groupby('origin')['cylinders'].median()

origin
europe    4.0
japan     4.0
usa       6.0
Name: cylinders, dtype: float64

In [17]:
df.groupby(['model_year','origin'])['cylinders'].mean()

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

In [18]:
pd.DataFrame(df.groupby(['model_year','origin'])['cylinders'].mean()).head()

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000

In [19]:
df2 = pd.DataFrame([[4,7,10],[5,11,8],[6,9,12]],
                  index=[1,2,3], columns = ['a','b','c'])
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [20]:
df2.shift(1)

     a     b     c
1  NaN   NaN   NaN
2  4.0   7.0  10.0
3  5.0  11.0   8.0

In [21]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [22]:
df2.shift(-1)

     a     b     c
1  5.0  11.0   8.0
2  6.0   9.0  12.0
3  NaN   NaN   NaN

In [23]:
df2.b.shift(-1)

1    11.0
2     9.0
3     NaN
Name: b, dtype: float64

In [24]:
df2.b.shift(-2)

1    9.0
2    NaN
3    NaN
Name: b, dtype: float64

In [36]:
df['model_year'].value_counts().sort_index()

70    29
71    28
72    28
73    40
74    27
75    30
76    34
77    28
78    36
79    29
80    29
81    29
82    31
Name: model_year, dtype: int64

In [28]:
df.groupby('model_year').size()

model_year
70    29
71    28
72    28
73    40
74    27
75    30
76    34
77    28
78    36
79    29
80    29
81    29
82    31
dtype: int64

In [38]:
df.model_year.min()

70

In [39]:
df.model_year.max()

82

In [41]:
df['model_year'].rank(method='min').value_counts().sort_index()

1.0      29
30.0     28
58.0     28
86.0     40
126.0    27
153.0    30
183.0    34
217.0    28
245.0    36
281.0    29
310.0    29
339.0    29
368.0    31
Name: model_year, dtype: int64

In [42]:
df['model_year'].rank(pct=True)

0      0.037688
1      0.037688
2      0.037688
3      0.037688
4      0.037688
         ...
393    0.962312
394    0.962312
395    0.962312
396    0.962312
397    0.962312
Name: model_year, Length: 398, dtype: float64

In [44]:
df['model_year'].rank(method='first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [45]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [46]:
df2.cumsum()

    a   b   c
1   4   7  10
2   9  18  18
3  15  27  30

In [47]:
df2.cummax()

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  12

In [48]:
df2.cummin()

   a  b   c
1  4  7  10
2  4  7   8
3  4  7   8

In [50]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [49]:
df2.cumprod()

     a    b    c
1    4    7   10
2   20   77   80
3  120  693  960